cf_billing/Documents/энргСменаПоставщикаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСменаПоставщикаМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПоставщикиУслугМКД</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчетаМКД</xr:Item>
				<xr:Item>InformationRegister.энргВыводПриборовУчетаМКД</xr:Item>
				<xr:Item>InformationRegister.энргПоставщикиУслугАбонента</xr:Item>
				<xr:Item>InformationRegister.энргМаксимальныеПоказанияМКД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоставщикиСоставныхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьСоставнойУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставщикПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставщикПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСоставнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводПрибораУчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоставщикиУслугМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоставщикиУслугМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоказанияПриборовУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоказанияПриборовУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеПоказаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Переворот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПриборовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ввод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вывод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПоверке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргСменаПоставщикаМКД/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойства массив приборов.
// 
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	энргСменаПоставщикаМКДТочкиУчета.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	энргСменаПоставщикаМКДПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСменаПоставщикаМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргСменаПоставщикаМКД.ПоказанияПриборовУчета КАК энргСменаПоставщикаМКДПоказанияПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ШкалыПриборовУчета КАК энргСменаПоставщикаМКДШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ТочкиУчета КАК энргСменаПоставщикаМКДТочкиУчета
	|			ПО энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка = энргСменаПоставщикаМКДТочкиУчета.Ссылка
	|				И энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтрокиТочкиУчета = энргСменаПоставщикаМКДТочкиУчета.IDСтроки
	|				И (НЕ энргСменаПоставщикаМКДТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|		ПО энргСменаПоставщикаМКДПоказанияПриборовУчета.Ссылка = энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка
	|			И энргСменаПоставщикаМКДПоказанияПриборовУчета.IDСтроки = энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтроки
	|ГДЕ
	|	энргСменаПоставщикаМКДПоказанияПриборовУчета.Ссылка = &Ссылка
	|	И энргСменаПоставщикаМКДТочкиУчета.Ссылка = &Ссылка
	|	И энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка = &Ссылка";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	МассивПриборов();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	ДанныеШапки 		= ДанныеШапки();
	
	СоотвествиеКолонок 	= Новый Структура;
	СоотвествиеКолонок.Вставить("ПриборУчета",				"ПриборУчета");
	СоотвествиеКолонок.Вставить("ТекущиеПоказания",			"ТекущиеПоказания");
	СоотвествиеКолонок.Вставить("ТочкаУчета",				"ТочкаУчета");
	
	Пакет = ПолучитьДанныеТЧ();	
	ДанныеПриборовТУ				= Пакет[0]; 
	ДанныеПриборовВывод				= Пакет[1];
	ДанныеПоказанийПриборовУчета	= Пакет[2];
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,	Движения.энргПоставщикиУслугМКД);
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета, Движения.энргПоказанияПриборовУчетаМКД);
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовВывод, Движения.энргВыводПриборовУчетаМКД);
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого СтрокаТЧ Из ТочкиУчета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПоставщикПосле) Тогда
			Если СтрокаТЧ.ЭтоСоставнаяУслуга Тогда
				Для каждого СтрокаСоставныхуслуг Из ПоставщикиСоставныхУслуг Цикл
					Если СтрокаТЧ.IDСтроки = СтрокаСоставныхуслуг.IDСтроки Тогда
						Если НЕ ЗначениеЗаполнено(СтрокаСоставныхуслуг.ПоставщикПосле)  Тогда	
							Отказ = истина;
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""ПоставщикПосле"" по услуге: " + СтрокаСоставныхуслуг.ЧастьСоставнойУслуги,ЭтотОбъект,"УслугиОбъектов["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла;
			Иначе
				Отказ = истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""ПоставщикПосле"" по услуге: " + СтрокаТЧ.Услуга,ЭтотОбъект,"УслугиОбъектов["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки() 	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район); 
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	ДанныеШапки.Вставить("МКД", 					МКД);
	ДанныеШапки.Вставить("ТочкиУчета",				ТочкиУчета);
	ДанныеШапки.Вставить("Документ",				Ссылка);  	
	ДанныеШапки.Вставить("ИмяДокумента",			"энргСменаПоставщикаМКД");
	Возврат ДанныеШапки;	
КонецФункции

Функция ПолучитьДанныеТЧ()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("мДокументы",				Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.МКД КАК МКД,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.ЧастьСоставной
	               |			ТОГДА ЕСТЬNULL(энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	               |		ИНАЧЕ ВложенныйЗапрос.Услуга
	               |	КОНЕЦ КАК Услуга,
	               |	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.ЧастьСоставной
	               |			ТОГДА ЕСТЬNULL(энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.ПоставщикПосле, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка))
	               |		ИНАЧЕ ВложенныйЗапрос.ПоставщикПосле
	               |	КОНЕЦ КАК Поставщик,
	               |	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ВТ_ТУ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА НЕ энргСменаПоставщикаМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА энргСменаПоставщикаМКД.ДатаФактическогоСобытия
	               |			ИНАЧЕ энргСменаПоставщикаМКД.Дата
	               |		КОНЕЦ КАК Период,
	               |		энргСменаПоставщикаМКД.Организация КАК Организация,
	               |		энргСменаПоставщикаМКД.Район КАК Район,
	               |		энргСменаПоставщикаМКД.МКД КАК МКД,
	               |		энргСменаПоставщикаМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	               |		энргСменаПоставщикаМКДТочкиУчета.Услуга КАК Услуга,
	               |		энргСменаПоставщикаМКДТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	               |		энргСменаПоставщикаМКДТочкиУчета.IDСтроки КАК IDСтроки,
	               |		энргСменаПоставщикаМКД.Дата КАК ПериодРегистрации,
	               |		НАЧАЛОПЕРИОДА(энргСменаПоставщикаМКД.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	               |		энргСменаПоставщикаМКД.Ссылка КАК Регистратор,
	               |		энргСменаПоставщикаМКДТочкиУчета.ПоставщикПосле КАК ПоставщикПосле,
	               |		энргСменаПоставщикаМКДТочкиУчета.ПриборУчета КАК ПриборУчета
	               |	ИЗ
	               |		Документ.энргСменаПоставщикаМКД КАК энргСменаПоставщикаМКД
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ТочкиУчета КАК энргСменаПоставщикаМКДТочкиУчета
	               |			ПО энргСменаПоставщикаМКД.Ссылка = энргСменаПоставщикаМКДТочкиУчета.Ссылка
	               |				И (энргСменаПоставщикаМКД.Ссылка В (&мДокументы))
	               |				И (энргСменаПоставщикаМКДТочкиУчета.Ссылка В (&мДокументы))) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ПоставщикиСоставныхУслуг КАК энргСменаПоставщикаМКДПоставщикиСоставныхУслуг
	               |		ПО ВложенныйЗапрос.Регистратор = энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.IDСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТУ.Период КАК Период,
	               |	ВТ_ТУ.Организация КАК Организация,
	               |	ВТ_ТУ.Район КАК Район,
	               |	ВТ_ТУ.МКД КАК МКД,
	               |	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	               |	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	               |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
	               |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	               |	ВТ_ТУ.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ВТ_ПУ
	               |ИЗ
	               |	ВТ_ТУ КАК ВТ_ТУ
	               |ГДЕ
	               |	НЕ ВТ_ТУ.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТУ.Период,
	               |	ВТ_ТУ.Организация,
	               |	ВТ_ТУ.Район,
	               |	ВТ_ТУ.МКД,
	               |	ВТ_ТУ.ПериодРегистрации,
	               |	ВТ_ТУ.ПериодНачисления,
	               |	ВТ_ТУ.ТочкаУчета,
	               |	ВТ_ТУ.ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.МКД КАК МКД,
	               |	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	               |	энргСменаПоставщикаМКДПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ВЫБОР
	               |		КОГДА НЕ ВложенныйЗапрос.РегистрируетОбъем
	               |			ТОГДА энргСменаПоставщикаМКДПоказанияПриборовУчета.ТекущиеПоказания
	               |		ИНАЧЕ энргСменаПоставщикаМКДПоказанияПриборовУчета.Разница
	               |	КОНЕЦ КАК Показание,
	               |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	               |	ЛОЖЬ КАК КС,
	               |	ЛОЖЬ КАК Переворот,
	               |	энргСменаПоставщикаМКДПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	               |	ВложенныйЗапрос.Шкала КАК Шкала
	               |ПОМЕСТИТЬ ВТ_ПоказанияПУ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Период КАК Период,
	               |		ВложенныйЗапрос.Организация КАК Организация,
	               |		ВложенныйЗапрос.Район КАК Район,
	               |		ВложенныйЗапрос.МКД КАК МКД,
	               |		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	               |		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	               |		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	               |		ВложенныйЗапрос.Регистратор КАК Регистратор,
	               |		энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	               |		энргСменаПоставщикаМКДШкалыПриборовУчета.Шкала КАК Шкала,
	               |		ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ВЫБОР
	               |				КОГДА НЕ энргСменаПоставщикаМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	               |					ТОГДА КОНЕЦПЕРИОДА(энргСменаПоставщикаМКД.ДатаФактическогоСобытия, ДЕНЬ)
	               |				ИНАЧЕ энргСменаПоставщикаМКД.Дата
	               |			КОНЕЦ КАК Период,
	               |			энргСменаПоставщикаМКД.Организация КАК Организация,
	               |			энргСменаПоставщикаМКД.Район КАК Район,
	               |			энргСменаПоставщикаМКД.МКД КАК МКД,
	               |			энргСменаПоставщикаМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	               |			энргСменаПоставщикаМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	               |			энргСменаПоставщикаМКД.Дата КАК ПериодРегистрации,
	               |			НАЧАЛОПЕРИОДА(энргСменаПоставщикаМКД.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	               |			энргСменаПоставщикаМКДТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	               |			энргСменаПоставщикаМКД.Ссылка КАК Регистратор,
	               |			энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем
	               |		ИЗ
	               |			Документ.энргСменаПоставщикаМКД КАК энргСменаПоставщикаМКД
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ТочкиУчета КАК энргСменаПоставщикаМКДТочкиУчета
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	               |					ПО энргСменаПоставщикаМКДТочкиУчета.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	               |				ПО энргСменаПоставщикаМКД.Ссылка = энргСменаПоставщикаМКДТочкиУчета.Ссылка
	               |					И (энргСменаПоставщикаМКД.Ссылка В (&мДокументы))
	               |					И (энргСменаПоставщикаМКДТочкиУчета.Ссылка В (&мДокументы))
	               |					И (НЕ энргСменаПоставщикаМКДТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ШкалыПриборовУчета КАК энргСменаПоставщикаМКДШкалыПриборовУчета
	               |			ПО ВложенныйЗапрос.Регистратор = энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка
	               |				И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ПоказанияПриборовУчета КАК энргСменаПоставщикаМКДПоказанияПриборовУчета
	               |		ПО ВложенныйЗапрос.Регистратор = энргСменаПоставщикаМКДПоказанияПриборовУчета.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = энргСменаПоставщикаМКДПоказанияПриборовУчета.IDСтроки";
	
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
